SQL Joins

In [2]:
### To execute the commands in each cell, press Shift + Enter 

## Import Pandas and NumPy modules 

import pandas as pd;
import numpy as np;

In [2]:
df_first = pd.DataFrame(columns=['user_id', 'user_name', 'user_phone'])

In [3]:
df_first.loc[0] = ['I001'] + ['Steven'] + ['+123456']

In [4]:
df_first.loc[1] = ['I002'] + ['Suresh'] + ['+234567']
df_first.loc[2] = ['I003'] + ['Chris'] + ['+333333']
df_first.loc[3] = ['I004'] + ['Harry'] + ['+444444']
df_first.loc[4] = ['I006'] + ['Suresh'] + ['+555555']

In [5]:
# SQL Equivalent: select * from first;

df_first

  user_id user_name user_phone
0    I001    Steven    +123456
1    I002    Suresh    +234567
2    I003     Chris    +333333
3    I004     Harry    +444444
4    I006    Suresh    +555555

In [6]:
# SQL Equivalent: select * from first where rownum<=3;

df_first.head(3)

  user_id user_name user_phone
0    I001    Steven    +123456
1    I002    Suresh    +234567
2    I003     Chris    +333333

In [7]:
# SQL Equivalent: select user_id, user_phone from first;

df_first[['user_id','user_phone']]

  user_id user_phone
0    I001    +123456
1    I002    +234567
2    I003    +333333
3    I004    +444444
4    I006    +555555

In [8]:
# SQL Equivalent: alter table first add user_age number;

df_first['user_age'] =np.NAN

In [9]:
df_first

  user_id user_name user_phone  user_age
0    I001    Steven    +123456       NaN
1    I002    Suresh    +234567       NaN
2    I003     Chris    +333333       NaN
3    I004     Harry    +444444       NaN
4    I006    Suresh    +555555       NaN

In [10]:
# SQL Equivalent: update first set user_age='25' where user_name='Suresh'; commit;

df_first['user_age'] =np.where(df_first['user_name']=='Suresh','25',df_first['user_age'])

In [12]:
df_first

  user_id user_name user_phone user_age
0    I001    Steven    +123456      nan
1    I002    Suresh    +234567       25
2    I003     Chris    +333333      nan
3    I004     Harry    +444444      nan
4    I006    Suresh    +555555       25

In [13]:
df_first['user_age'] =np.where(df_first['user_name']=='Steven','30',df_first['user_age'])
df_first['user_age'] =np.where(df_first['user_name']=='Chris','35',df_first['user_age'])
df_first['user_age'] =np.where(df_first['user_name']=='Harry','32',df_first['user_age'])

In [14]:
df_first

  user_id user_name user_phone user_age
0    I001    Steven    +123456       30
1    I002    Suresh    +234567       25
2    I003     Chris    +333333       35
3    I004     Harry    +444444       32
4    I006    Suresh    +555555       25

In [15]:
df_first['user_age'] =np.where(df_first['user_name']=='Harry',np.NAN,df_first['user_age'])

In [16]:
df_first

  user_id user_name user_phone user_age
0    I001    Steven    +123456       30
1    I002    Suresh    +234567       25
2    I003     Chris    +333333       35
3    I004     Harry    +444444      NaN
4    I006    Suresh    +555555       25

In [17]:
# SQL Equivalent: update first set user_age='32' where user_age is null; commit;

df_first.fillna({'user_age':'32'},inplace=True)
df_first

  user_id user_name user_phone user_age
0    I001    Steven    +123456       30
1    I002    Suresh    +234567       25
2    I003     Chris    +333333       35
3    I004     Harry    +444444       32
4    I006    Suresh    +555555       25

In [18]:
# SQL Equivalent: select user_id, user_name, user_age from first where user_name='Suresh';

df_first[['user_id','user_name','user_age']][df_first['user_name'] =='Suresh']

  user_id user_name user_age
1    I002    Suresh       25
4    I006    Suresh       25

In [20]:
# SQL Equivalent: select user_id, user_name, user_age from first where user_name='Suresh' order by user_name desc;

df_first[['user_id','user_name','user_age']].sort_values(by=['user_name'],ascending=[False])

  user_id user_name user_age
1    I002    Suresh       25
4    I006    Suresh       25
0    I001    Steven       30
3    I004     Harry       32
2    I003     Chris       35

In [21]:
df_first

  user_id user_name user_phone user_age
0    I001    Steven    +123456       30
1    I002    Suresh    +234567       25
2    I003     Chris    +333333       35
3    I004     Harry    +444444       32
4    I006    Suresh    +555555       25

#Import Table Data Records from Oracle Database to Pandas's DataFrame

In [ ]:
## Install the cx_Oracle module, if not installed earlier.

!pip install cx_Oracle

In [3]:
import cx_Oracle;

In [4]:
## Replace db_user/db_pass with actual values before executing

conn = cx_Oracle.connect('db_user/db_pass@localhost')

In [5]:

cursor = conn.cursor()
query ="""  select * 
            from second
            """
df_second = pd.read_sql(query, con=conn)

In [6]:
df_second

  USER_ID  USER_DEPT USER_LOCATION
0    I001         IT       Ontario
1    I002  Marketing       Ontario
2    I005    Finance   Nova Scotia

In [26]:
df_first.set_index('user_id')

        user_name user_phone user_age
user_id
I001       Steven    +123456       30
I002       Suresh    +234567       25
I003        Chris    +333333       35
I004        Harry    +444444       32
I006       Suresh    +555555       25

In [7]:
df_second.columns = [i.lower() for i in df_second.columns]
df_second.set_index('user_id')

         user_dept user_location
user_id
I001            IT       Ontario
I002     Marketing       Ontario
I005       Finance   Nova Scotia

<img height="60" width="120" src="C:/Users/Tejinder/leftjoin.png"></img>

In [31]:
## Inner Join

# SQL Equivalent: select * from first f inner join second s on f.user_id=s.user_id; 

pd.merge(df_first, df_second, on='user_id')

  user_id user_name user_phone user_age  user_dept user_location
0    I001    Steven    +123456       30         IT       Ontario
1    I002    Suresh    +234567       25  Marketing       Ontario

In [32]:
## left Join

# SQL Equivalent: select * from first f left join second s on f.user_id=s.user_id; 

pd.merge(df_first, df_second, on='user_id', how='left')

  user_id user_name user_phone user_age  user_dept user_location
0    I001    Steven    +123456       30         IT       Ontario
1    I002    Suresh    +234567       25  Marketing       Ontario
2    I003     Chris    +333333       35        NaN           NaN
3    I004     Harry    +444444       32        NaN           NaN
4    I006    Suresh    +555555       25        NaN           NaN

In [33]:
## right Join

# SQL Equivalent: select * from first f right join second s on f.user_id=s.user_id; 

pd.merge(df_first, df_second, on='user_id', how='right')

  user_id user_name user_phone user_age  user_dept user_location
0    I001    Steven    +123456       30         IT       Ontario
1    I002    Suresh    +234567       25  Marketing       Ontario
2    I005       NaN        NaN      NaN    Finance   Nova Scotia

In [34]:
## Left join excluding common records

# SQL Equivalent: select * from first f left join second s on f.user_id=s.user_id where s.user_id is null; 

df_first.merge(df_second, indicator='i',how='outer').query('i=="left_only"').drop('i',1)

  user_id user_name user_phone user_age user_dept user_location
2    I003     Chris    +333333       35       NaN           NaN
3    I004     Harry    +444444       32       NaN           NaN
4    I006    Suresh    +555555       25       NaN           NaN

In [35]:
## Full outer Join

# SQL Equivalent: select * from first f full join second s on f.user_id=s.user_id

pd.merge(df_first, df_second, on='user_id', how='outer')

  user_id user_name user_phone user_age  user_dept user_location
0    I001    Steven    +123456       30         IT       Ontario
1    I002    Suresh    +234567       25  Marketing       Ontario
2    I003     Chris    +333333       35        NaN           NaN
3    I004     Harry    +444444       32        NaN           NaN
4    I006    Suresh    +555555       25        NaN           NaN
5    I005       NaN        NaN      NaN    Finance   Nova Scotia

Index(['user_id', 'user_name', 'user_phone'], dtype='object')

In [23]:
df_first.loc[2] = ['I004'] + ['Harry'] + ['3333333']

In [24]:
df_first

  user_id user_name user_phone
0    I001    Steven     123456
1    I002    Suresh     234567
2    I004     Harry    3333333

In [25]:
df_first[['user_id','user_phone']]

  user_id user_phone
0    I001     123456
1    I002     234567
2    I004    3333333

In [27]:
# SQL Equivalent: select user_id, user_name from first where user_name='Steven'

df_first[['user_id','user_name']][df_first.user_name =='Steven']

  user_name user_name
0    Steven    Steven

In [30]:
# SQL Equivalent: select user_id, user_name from first where user_name='Steven' or user_name='Harry'

df_first[['user_id','user_name']][(df_first['user_name'] =='Steven') | (df_first.user_name =='Harry')]

  user_id user_name
0    I001    Steven
2    I004     Harry

In [31]:
import numpy as np

In [32]:
# SQL Equivalent: update first set user_age=null; commit;

df_first['user_age']=np.NAN

In [33]:
df_first

  user_id user_name user_phone  user_age
0    I001    Steven     123456       NaN
1    I002    Suresh     234567       NaN
2    I004     Harry    3333333       NaN

In [36]:


df_first['user_age'].fillna(value=5, inplace=True)